src/geekbang-tech-management-practice.org
#+title: 极客时间|技术管理实战36讲 文章目录
#+options: num:nil


** [[https://time.geekbang.org/column/article/13156][开篇词 | 你为什么需要学管理？]]

与其说管理是一个职位，倒不如说管理是一组能力，是每个人职业发展中都绕不开的话题。本专栏会为你阐释管理的方...


** [[https://time.geekbang.org/column/article/13387][01  | 多年前的那些工程师都去哪了？]]

也许是现在，也许是未来，总有那么一天，你会操心自己的职业发展。当你抬起头来，眺望自己的职业道路的时候，也...


** [[https://time.geekbang.org/column/article/13618][02  | 我要不要做管理呢？内心好纠结！]]

很多技术人在考虑是否适合做管理时，往往是从外在“得失”去做决策的，到真正做了管理时才发现并不是自己想要的...


** [[https://time.geekbang.org/column/article/13687][03 | 哪些人比较容易走上管理岗位？]]

本文主要和你探讨，如何才能顺利地走上管理岗位，哪些因素可以帮助你得偿所愿。


** [[https://time.geekbang.org/column/article/13897][04 | 我要不要转回去做技术呢？]]

你是否还处在技术转管理的门口纠结和彷徨？今天我就给你开出“三个药方”，缓解你的烦恼，给你一些启发，帮助你...


** [[https://time.geekbang.org/column/article/14053][05 | 作为技术管理者，我如何保持技术判断力？]]

很多技术人在转做管理后，会担心如何持续保持自己的技术能力。


** [[https://time.geekbang.org/column/article/14235][06 | 我这样的风格能做管理吗？]]

很多新经理常常会自我怀疑，觉得自己的性格、做事风格不适合做管理。本文主要帮大家阐述一个问题，就是什么样的...


** [[https://time.geekbang.org/column/article/14422][07 | 我能做好管理吗，大家服我吗？]]

在新经理的常见困惑中，“不自信”是其中很普遍的一个情况。希望通过本文的论述，帮时不时“自我怀疑”的新管理...


** [[https://time.geekbang.org/column/article/14534][08 | 管理到底都做哪些事儿？]]

本文会把“管理都做哪些事儿”的工作框架介绍给大家，同时这也是整个专栏的内容框架。


** [[https://time.geekbang.org/column/article/14762][09 | 从工程师到管理者，角色都发生了哪些变化？]]

从一个IC职位到一个manager/leader职位，要面临着很重要的角色转型，本文将系统阐述在这个过程中都有哪些地方...


** [[https://time.geekbang.org/column/article/17830][10 | 新经理常踩的坑儿有哪些？]]

新经理在角色认知方面有很多常见的误区，希望你未雨绸缪，有则改之，无则加勉。


** [[https://time.geekbang.org/column/article/18029][11 | 我刚开始带团队，从哪里着手呢？]]

作为管理者，花些时间来做做自己团队的管理规划，绝对是值得和必要的。


** [[https://time.geekbang.org/column/article/18040][12 | 如何界定我团队是干什么的呢？]]

本文详细说明了明确团队职能的重要意义和设定方法，使得新经理可以实操管理规划的第一个要素：职能。


** [[https://time.geekbang.org/column/article/20712][13 | 如何为团队设定合理的目标呢？]]

本文和新经理分享目标的价值和设定原则，并就常见的问题和挑战进行探讨。


** [[https://time.geekbang.org/column/article/39779][14 | 如何来规划团队的组织结构呢？]]

本文和新经理分享如何盘点和规划自己的团队，并了解团队规划的一般呈现形式。


** [[https://time.geekbang.org/column/article/39973][15 | 我都要申请哪些资源呢？]]

管理者要做战略，所谓战略是什么呢？其实就是筹划把资源投在什么方向，以达成什么目标。所以，资源视角就是战略...


** [[https://time.geekbang.org/column/article/40043][16 | 团队建设该从哪里入手？]]

“团队建设”是个复合概念，一说都理解，但细一琢磨，往往又不知道从哪里入手。本文我会给你一个带团队的“透视...


** [[https://time.geekbang.org/column/article/40277][17 | 如何提升员工的个人能力？]]

本文探讨了提升员工个人能力的常见做法和一些原则。


** [[https://time.geekbang.org/column/article/40313][18 | 如何提升员工的工作意愿和积极性？]]

本文和大家探讨员工激励的话题，聊一聊如何提升员工的工作意愿和积极性。


** [[https://time.geekbang.org/column/article/40513][19 | 如何兼顾团队分工的稳定性和灵活性？]]

团队管理中，如何做好人员安排和工作划分，是实现高效合作的关键。本文就为大家详细阐述我在团队分工中的一些经...


** [[https://time.geekbang.org/column/article/40516][20 | 有什么方法可以有效提升团队凝聚力吗？]]

一个非常有凝聚力的团队，对于良好的协作有着直接和关键的影响。本文就和大家探讨如何提升团队的凝聚力，让团队...


** [[https://time.geekbang.org/column/article/40771][21 | 如何物色和培养核心人才？]]

本文探讨如何选拔和培养人才，其中重点探讨如何授权。


** [[https://time.geekbang.org/column/article/40772][22 | 如何建设团队文化，营造团队氛围？]]

本文探讨打造团队文化的必要性和方法步骤，并教你如何避开误区。


** [[https://time.geekbang.org/column/article/40776][23 | 如何和低绩效员工谈绩效？]]

本文从和低绩效员工谈绩效切入，探讨了绩效管理的基本方法和误区。


** [[https://time.geekbang.org/column/article/40780][24 | 如何让团建活动不再“收效甚微”？]]

本文和大家探讨如何设计团建活动，并避开团建活动当中的常见误区。


** [[https://time.geekbang.org/column/article/41448][25 | 多任务并行该如何应对？]]

本文和大家开启“任务管理”这个主题，并探讨如何应对多任务并行。


** [[https://time.geekbang.org/column/article/41653][26 | 如何确保项目的有效执行？]]

本文和大家探讨确保项目有效执行落地的要素。


** [[https://time.geekbang.org/column/article/41830][27 | 如何让流程机制得到有效的执行？]]

本文和大家探讨如何才能让流程机制得到有效的执行。


** [[https://time.geekbang.org/column/article/41968][28 | 管理沟通那些事儿]]

管理沟通就恰似管理工作的载体，是如此重要。本文就先和大家探讨管理沟通的整体框架。


** [[https://time.geekbang.org/column/article/42064][29 | 沟通经常鸡同鸭讲，说不到一块怎么办？]]

沟通中常常会遇到的一个情况就是，你说你的、他说他的，好似“鸡同鸭讲”，这怎么办呢？本文就和大家分享：如何...


** [[https://time.geekbang.org/column/article/42393][30 | 如何掌控自己的情绪，以及如何管理情绪化的员工？]]

在管理工作中，不可避免地会碰到一些容易情绪化的合作者，甚至有可能是我们自己。所以，今天，我们得谈谈“情绪...


** [[https://time.geekbang.org/column/article/42582][31 | 我各方面做得都很好，就是做不好向上沟通]]

本文探讨向上管理和向上沟通中的常见问题和困惑。


** [[https://time.geekbang.org/column/article/42770][32 | 横向沟通和非职权影响力]]

本文主要探讨横向沟通和非职权影响力的相关问题。


** [[https://time.geekbang.org/column/article/42904][33 | 向下沟通的常见实例解析]]

本文主要探讨向下沟通的常见问题。


** [[https://time.geekbang.org/column/article/64371][34 | 管理沟通上有哪些常见的坑儿呢？]]

本文主要探讨技术管理者（尤其是新管理者）常见的沟通误区。


** [[https://time.geekbang.org/column/article/64689][35 | 从空降谈管理方法论的积累]]

本文主要探讨如何积累自己的管理方法论。


** [[https://time.geekbang.org/column/article/65140][36 | 走出自己的管理之路]]

本文主要探讨适合自己的管理之路。


** [[https://time.geekbang.org/column/article/67186][复习课（一） | 管理方法论和角色认知]]

本文以图文的形式带你复习一下“管理方法论”和“角色认知”。


** [[https://time.geekbang.org/column/article/67690][复习课（二） | 管理规划]]

本文以图文的形式带你复习一下“管理规划”。


** [[https://time.geekbang.org/column/article/68046][复习课（三） | 团队建设]]

本文以图文的形式带你复习一下“团队建设”。


** [[https://time.geekbang.org/column/article/68509][复习课（四） | 任务管理]]

本文以图文的形式带你复习一下“任务管理”。


** [[https://time.geekbang.org/column/article/68785][复习课（五） | 管理沟通]]

本文以图文的形式带你复习一下“管理沟通”。

