html/geekbang-tech-management-practice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>极客时间|技术管理实战36讲 文章目录</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">极客时间|技术管理实战36讲 文章目录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge075918">开篇词 | 你为什么需要学管理？</a></li>
<li><a href="#orgeb5d18b">01  | 多年前的那些工程师都去哪了？</a></li>
<li><a href="#org0777d98">02  | 我要不要做管理呢？内心好纠结！</a></li>
<li><a href="#org14de4e7">03 | 哪些人比较容易走上管理岗位？</a></li>
<li><a href="#org8042cfd">04 | 我要不要转回去做技术呢？</a></li>
<li><a href="#orge5a399f">05 | 作为技术管理者，我如何保持技术判断力？</a></li>
<li><a href="#org2ebbc37">06 | 我这样的风格能做管理吗？</a></li>
<li><a href="#orgb403786">07 | 我能做好管理吗，大家服我吗？</a></li>
<li><a href="#orge159e5a">08 | 管理到底都做哪些事儿？</a></li>
<li><a href="#org973bc45">09 | 从工程师到管理者，角色都发生了哪些变化？</a></li>
<li><a href="#org8397b58">10 | 新经理常踩的坑儿有哪些？</a></li>
<li><a href="#org7f3a3fe">11 | 我刚开始带团队，从哪里着手呢？</a></li>
<li><a href="#orga2cfcde">12 | 如何界定我团队是干什么的呢？</a></li>
<li><a href="#orgde6700d">13 | 如何为团队设定合理的目标呢？</a></li>
<li><a href="#orgc85ef76">14 | 如何来规划团队的组织结构呢？</a></li>
<li><a href="#org92ca469">15 | 我都要申请哪些资源呢？</a></li>
<li><a href="#orgf263776">16 | 团队建设该从哪里入手？</a></li>
<li><a href="#org51ec2b4">17 | 如何提升员工的个人能力？</a></li>
<li><a href="#orgb22a158">18 | 如何提升员工的工作意愿和积极性？</a></li>
<li><a href="#org2f65c46">19 | 如何兼顾团队分工的稳定性和灵活性？</a></li>
<li><a href="#orgcd5c071">20 | 有什么方法可以有效提升团队凝聚力吗？</a></li>
<li><a href="#org08664a4">21 | 如何物色和培养核心人才？</a></li>
<li><a href="#org8864e4f">22 | 如何建设团队文化，营造团队氛围？</a></li>
<li><a href="#org7344a74">23 | 如何和低绩效员工谈绩效？</a></li>
<li><a href="#org56ba9d1">24 | 如何让团建活动不再“收效甚微”？</a></li>
<li><a href="#org226661e">25 | 多任务并行该如何应对？</a></li>
<li><a href="#org78e8451">26 | 如何确保项目的有效执行？</a></li>
<li><a href="#orge5f6395">27 | 如何让流程机制得到有效的执行？</a></li>
<li><a href="#org3cec65a">28 | 管理沟通那些事儿</a></li>
<li><a href="#org905cb68">29 | 沟通经常鸡同鸭讲，说不到一块怎么办？</a></li>
<li><a href="#org988c3ca">30 | 如何掌控自己的情绪，以及如何管理情绪化的员工？</a></li>
<li><a href="#org36d28ee">31 | 我各方面做得都很好，就是做不好向上沟通</a></li>
<li><a href="#org3f57122">32 | 横向沟通和非职权影响力</a></li>
<li><a href="#org6ce32ea">33 | 向下沟通的常见实例解析</a></li>
<li><a href="#orgffcc06a">34 | 管理沟通上有哪些常见的坑儿呢？</a></li>
<li><a href="#org7b36cff">35 | 从空降谈管理方法论的积累</a></li>
<li><a href="#org3242668">36 | 走出自己的管理之路</a></li>
<li><a href="#org2632cb2">复习课（一） | 管理方法论和角色认知</a></li>
<li><a href="#org519a22a">复习课（二） | 管理规划</a></li>
<li><a href="#org40d3d2c">复习课（三） | 团队建设</a></li>
<li><a href="#org36f25ff">复习课（四） | 任务管理</a></li>
<li><a href="#org7bc85d5">复习课（五） | 管理沟通</a></li>
</ul>
</div>
</div>


<div id="outline-container-orge075918" class="outline-2">
<h2 id="orge075918"><a href="https://time.geekbang.org/column/article/13156">开篇词 | 你为什么需要学管理？</a></h2>
<div class="outline-text-2" id="text-orge075918">
<p>
与其说管理是一个职位，倒不如说管理是一组能力，是每个人职业发展中都绕不开的话题。本专栏会为你阐释管理的方&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgeb5d18b" class="outline-2">
<h2 id="orgeb5d18b"><a href="https://time.geekbang.org/column/article/13387">01  | 多年前的那些工程师都去哪了？</a></h2>
<div class="outline-text-2" id="text-orgeb5d18b">
<p>
也许是现在，也许是未来，总有那么一天，你会操心自己的职业发展。当你抬起头来，眺望自己的职业道路的时候，也&#x2026;
</p>
</div>
</div>


<div id="outline-container-org0777d98" class="outline-2">
<h2 id="org0777d98"><a href="https://time.geekbang.org/column/article/13618">02  | 我要不要做管理呢？内心好纠结！</a></h2>
<div class="outline-text-2" id="text-org0777d98">
<p>
很多技术人在考虑是否适合做管理时，往往是从外在“得失”去做决策的，到真正做了管理时才发现并不是自己想要的&#x2026;
</p>
</div>
</div>


<div id="outline-container-org14de4e7" class="outline-2">
<h2 id="org14de4e7"><a href="https://time.geekbang.org/column/article/13687">03 | 哪些人比较容易走上管理岗位？</a></h2>
<div class="outline-text-2" id="text-org14de4e7">
<p>
本文主要和你探讨，如何才能顺利地走上管理岗位，哪些因素可以帮助你得偿所愿。
</p>
</div>
</div>


<div id="outline-container-org8042cfd" class="outline-2">
<h2 id="org8042cfd"><a href="https://time.geekbang.org/column/article/13897">04 | 我要不要转回去做技术呢？</a></h2>
<div class="outline-text-2" id="text-org8042cfd">
<p>
你是否还处在技术转管理的门口纠结和彷徨？今天我就给你开出“三个药方”，缓解你的烦恼，给你一些启发，帮助你&#x2026;
</p>
</div>
</div>


<div id="outline-container-orge5a399f" class="outline-2">
<h2 id="orge5a399f"><a href="https://time.geekbang.org/column/article/14053">05 | 作为技术管理者，我如何保持技术判断力？</a></h2>
<div class="outline-text-2" id="text-orge5a399f">
<p>
很多技术人在转做管理后，会担心如何持续保持自己的技术能力。
</p>
</div>
</div>


<div id="outline-container-org2ebbc37" class="outline-2">
<h2 id="org2ebbc37"><a href="https://time.geekbang.org/column/article/14235">06 | 我这样的风格能做管理吗？</a></h2>
<div class="outline-text-2" id="text-org2ebbc37">
<p>
很多新经理常常会自我怀疑，觉得自己的性格、做事风格不适合做管理。本文主要帮大家阐述一个问题，就是什么样的&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgb403786" class="outline-2">
<h2 id="orgb403786"><a href="https://time.geekbang.org/column/article/14422">07 | 我能做好管理吗，大家服我吗？</a></h2>
<div class="outline-text-2" id="text-orgb403786">
<p>
在新经理的常见困惑中，“不自信”是其中很普遍的一个情况。希望通过本文的论述，帮时不时“自我怀疑”的新管理&#x2026;
</p>
</div>
</div>


<div id="outline-container-orge159e5a" class="outline-2">
<h2 id="orge159e5a"><a href="https://time.geekbang.org/column/article/14534">08 | 管理到底都做哪些事儿？</a></h2>
<div class="outline-text-2" id="text-orge159e5a">
<p>
本文会把“管理都做哪些事儿”的工作框架介绍给大家，同时这也是整个专栏的内容框架。
</p>
</div>
</div>


<div id="outline-container-org973bc45" class="outline-2">
<h2 id="org973bc45"><a href="https://time.geekbang.org/column/article/14762">09 | 从工程师到管理者，角色都发生了哪些变化？</a></h2>
<div class="outline-text-2" id="text-org973bc45">
<p>
从一个IC职位到一个manager/leader职位，要面临着很重要的角色转型，本文将系统阐述在这个过程中都有哪些地方&#x2026;
</p>
</div>
</div>


<div id="outline-container-org8397b58" class="outline-2">
<h2 id="org8397b58"><a href="https://time.geekbang.org/column/article/17830">10 | 新经理常踩的坑儿有哪些？</a></h2>
<div class="outline-text-2" id="text-org8397b58">
<p>
新经理在角色认知方面有很多常见的误区，希望你未雨绸缪，有则改之，无则加勉。
</p>
</div>
</div>


<div id="outline-container-org7f3a3fe" class="outline-2">
<h2 id="org7f3a3fe"><a href="https://time.geekbang.org/column/article/18029">11 | 我刚开始带团队，从哪里着手呢？</a></h2>
<div class="outline-text-2" id="text-org7f3a3fe">
<p>
作为管理者，花些时间来做做自己团队的管理规划，绝对是值得和必要的。
</p>
</div>
</div>


<div id="outline-container-orga2cfcde" class="outline-2">
<h2 id="orga2cfcde"><a href="https://time.geekbang.org/column/article/18040">12 | 如何界定我团队是干什么的呢？</a></h2>
<div class="outline-text-2" id="text-orga2cfcde">
<p>
本文详细说明了明确团队职能的重要意义和设定方法，使得新经理可以实操管理规划的第一个要素：职能。
</p>
</div>
</div>


<div id="outline-container-orgde6700d" class="outline-2">
<h2 id="orgde6700d"><a href="https://time.geekbang.org/column/article/20712">13 | 如何为团队设定合理的目标呢？</a></h2>
<div class="outline-text-2" id="text-orgde6700d">
<p>
本文和新经理分享目标的价值和设定原则，并就常见的问题和挑战进行探讨。
</p>
</div>
</div>


<div id="outline-container-orgc85ef76" class="outline-2">
<h2 id="orgc85ef76"><a href="https://time.geekbang.org/column/article/39779">14 | 如何来规划团队的组织结构呢？</a></h2>
<div class="outline-text-2" id="text-orgc85ef76">
<p>
本文和新经理分享如何盘点和规划自己的团队，并了解团队规划的一般呈现形式。
</p>
</div>
</div>


<div id="outline-container-org92ca469" class="outline-2">
<h2 id="org92ca469"><a href="https://time.geekbang.org/column/article/39973">15 | 我都要申请哪些资源呢？</a></h2>
<div class="outline-text-2" id="text-org92ca469">
<p>
管理者要做战略，所谓战略是什么呢？其实就是筹划把资源投在什么方向，以达成什么目标。所以，资源视角就是战略&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf263776" class="outline-2">
<h2 id="orgf263776"><a href="https://time.geekbang.org/column/article/40043">16 | 团队建设该从哪里入手？</a></h2>
<div class="outline-text-2" id="text-orgf263776">
<p>
“团队建设”是个复合概念，一说都理解，但细一琢磨，往往又不知道从哪里入手。本文我会给你一个带团队的“透视&#x2026;
</p>
</div>
</div>


<div id="outline-container-org51ec2b4" class="outline-2">
<h2 id="org51ec2b4"><a href="https://time.geekbang.org/column/article/40277">17 | 如何提升员工的个人能力？</a></h2>
<div class="outline-text-2" id="text-org51ec2b4">
<p>
本文探讨了提升员工个人能力的常见做法和一些原则。
</p>
</div>
</div>


<div id="outline-container-orgb22a158" class="outline-2">
<h2 id="orgb22a158"><a href="https://time.geekbang.org/column/article/40313">18 | 如何提升员工的工作意愿和积极性？</a></h2>
<div class="outline-text-2" id="text-orgb22a158">
<p>
本文和大家探讨员工激励的话题，聊一聊如何提升员工的工作意愿和积极性。
</p>
</div>
</div>


<div id="outline-container-org2f65c46" class="outline-2">
<h2 id="org2f65c46"><a href="https://time.geekbang.org/column/article/40513">19 | 如何兼顾团队分工的稳定性和灵活性？</a></h2>
<div class="outline-text-2" id="text-org2f65c46">
<p>
团队管理中，如何做好人员安排和工作划分，是实现高效合作的关键。本文就为大家详细阐述我在团队分工中的一些经&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgcd5c071" class="outline-2">
<h2 id="orgcd5c071"><a href="https://time.geekbang.org/column/article/40516">20 | 有什么方法可以有效提升团队凝聚力吗？</a></h2>
<div class="outline-text-2" id="text-orgcd5c071">
<p>
一个非常有凝聚力的团队，对于良好的协作有着直接和关键的影响。本文就和大家探讨如何提升团队的凝聚力，让团队&#x2026;
</p>
</div>
</div>


<div id="outline-container-org08664a4" class="outline-2">
<h2 id="org08664a4"><a href="https://time.geekbang.org/column/article/40771">21 | 如何物色和培养核心人才？</a></h2>
<div class="outline-text-2" id="text-org08664a4">
<p>
本文探讨如何选拔和培养人才，其中重点探讨如何授权。
</p>
</div>
</div>


<div id="outline-container-org8864e4f" class="outline-2">
<h2 id="org8864e4f"><a href="https://time.geekbang.org/column/article/40772">22 | 如何建设团队文化，营造团队氛围？</a></h2>
<div class="outline-text-2" id="text-org8864e4f">
<p>
本文探讨打造团队文化的必要性和方法步骤，并教你如何避开误区。
</p>
</div>
</div>


<div id="outline-container-org7344a74" class="outline-2">
<h2 id="org7344a74"><a href="https://time.geekbang.org/column/article/40776">23 | 如何和低绩效员工谈绩效？</a></h2>
<div class="outline-text-2" id="text-org7344a74">
<p>
本文从和低绩效员工谈绩效切入，探讨了绩效管理的基本方法和误区。
</p>
</div>
</div>


<div id="outline-container-org56ba9d1" class="outline-2">
<h2 id="org56ba9d1"><a href="https://time.geekbang.org/column/article/40780">24 | 如何让团建活动不再“收效甚微”？</a></h2>
<div class="outline-text-2" id="text-org56ba9d1">
<p>
本文和大家探讨如何设计团建活动，并避开团建活动当中的常见误区。
</p>
</div>
</div>


<div id="outline-container-org226661e" class="outline-2">
<h2 id="org226661e"><a href="https://time.geekbang.org/column/article/41448">25 | 多任务并行该如何应对？</a></h2>
<div class="outline-text-2" id="text-org226661e">
<p>
本文和大家开启“任务管理”这个主题，并探讨如何应对多任务并行。
</p>
</div>
</div>


<div id="outline-container-org78e8451" class="outline-2">
<h2 id="org78e8451"><a href="https://time.geekbang.org/column/article/41653">26 | 如何确保项目的有效执行？</a></h2>
<div class="outline-text-2" id="text-org78e8451">
<p>
本文和大家探讨确保项目有效执行落地的要素。
</p>
</div>
</div>


<div id="outline-container-orge5f6395" class="outline-2">
<h2 id="orge5f6395"><a href="https://time.geekbang.org/column/article/41830">27 | 如何让流程机制得到有效的执行？</a></h2>
<div class="outline-text-2" id="text-orge5f6395">
<p>
本文和大家探讨如何才能让流程机制得到有效的执行。
</p>
</div>
</div>


<div id="outline-container-org3cec65a" class="outline-2">
<h2 id="org3cec65a"><a href="https://time.geekbang.org/column/article/41968">28 | 管理沟通那些事儿</a></h2>
<div class="outline-text-2" id="text-org3cec65a">
<p>
管理沟通就恰似管理工作的载体，是如此重要。本文就先和大家探讨管理沟通的整体框架。
</p>
</div>
</div>


<div id="outline-container-org905cb68" class="outline-2">
<h2 id="org905cb68"><a href="https://time.geekbang.org/column/article/42064">29 | 沟通经常鸡同鸭讲，说不到一块怎么办？</a></h2>
<div class="outline-text-2" id="text-org905cb68">
<p>
沟通中常常会遇到的一个情况就是，你说你的、他说他的，好似“鸡同鸭讲”，这怎么办呢？本文就和大家分享：如何&#x2026;
</p>
</div>
</div>


<div id="outline-container-org988c3ca" class="outline-2">
<h2 id="org988c3ca"><a href="https://time.geekbang.org/column/article/42393">30 | 如何掌控自己的情绪，以及如何管理情绪化的员工？</a></h2>
<div class="outline-text-2" id="text-org988c3ca">
<p>
在管理工作中，不可避免地会碰到一些容易情绪化的合作者，甚至有可能是我们自己。所以，今天，我们得谈谈“情绪&#x2026;
</p>
</div>
</div>


<div id="outline-container-org36d28ee" class="outline-2">
<h2 id="org36d28ee"><a href="https://time.geekbang.org/column/article/42582">31 | 我各方面做得都很好，就是做不好向上沟通</a></h2>
<div class="outline-text-2" id="text-org36d28ee">
<p>
本文探讨向上管理和向上沟通中的常见问题和困惑。
</p>
</div>
</div>


<div id="outline-container-org3f57122" class="outline-2">
<h2 id="org3f57122"><a href="https://time.geekbang.org/column/article/42770">32 | 横向沟通和非职权影响力</a></h2>
<div class="outline-text-2" id="text-org3f57122">
<p>
本文主要探讨横向沟通和非职权影响力的相关问题。
</p>
</div>
</div>


<div id="outline-container-org6ce32ea" class="outline-2">
<h2 id="org6ce32ea"><a href="https://time.geekbang.org/column/article/42904">33 | 向下沟通的常见实例解析</a></h2>
<div class="outline-text-2" id="text-org6ce32ea">
<p>
本文主要探讨向下沟通的常见问题。
</p>
</div>
</div>


<div id="outline-container-orgffcc06a" class="outline-2">
<h2 id="orgffcc06a"><a href="https://time.geekbang.org/column/article/64371">34 | 管理沟通上有哪些常见的坑儿呢？</a></h2>
<div class="outline-text-2" id="text-orgffcc06a">
<p>
本文主要探讨技术管理者（尤其是新管理者）常见的沟通误区。
</p>
</div>
</div>


<div id="outline-container-org7b36cff" class="outline-2">
<h2 id="org7b36cff"><a href="https://time.geekbang.org/column/article/64689">35 | 从空降谈管理方法论的积累</a></h2>
<div class="outline-text-2" id="text-org7b36cff">
<p>
本文主要探讨如何积累自己的管理方法论。
</p>
</div>
</div>


<div id="outline-container-org3242668" class="outline-2">
<h2 id="org3242668"><a href="https://time.geekbang.org/column/article/65140">36 | 走出自己的管理之路</a></h2>
<div class="outline-text-2" id="text-org3242668">
<p>
本文主要探讨适合自己的管理之路。
</p>
</div>
</div>


<div id="outline-container-org2632cb2" class="outline-2">
<h2 id="org2632cb2"><a href="https://time.geekbang.org/column/article/67186">复习课（一） | 管理方法论和角色认知</a></h2>
<div class="outline-text-2" id="text-org2632cb2">
<p>
本文以图文的形式带你复习一下“管理方法论”和“角色认知”。
</p>
</div>
</div>


<div id="outline-container-org519a22a" class="outline-2">
<h2 id="org519a22a"><a href="https://time.geekbang.org/column/article/67690">复习课（二） | 管理规划</a></h2>
<div class="outline-text-2" id="text-org519a22a">
<p>
本文以图文的形式带你复习一下“管理规划”。
</p>
</div>
</div>


<div id="outline-container-org40d3d2c" class="outline-2">
<h2 id="org40d3d2c"><a href="https://time.geekbang.org/column/article/68046">复习课（三） | 团队建设</a></h2>
<div class="outline-text-2" id="text-org40d3d2c">
<p>
本文以图文的形式带你复习一下“团队建设”。
</p>
</div>
</div>


<div id="outline-container-org36f25ff" class="outline-2">
<h2 id="org36f25ff"><a href="https://time.geekbang.org/column/article/68509">复习课（四） | 任务管理</a></h2>
<div class="outline-text-2" id="text-org36f25ff">
<p>
本文以图文的形式带你复习一下“任务管理”。
</p>
</div>
</div>


<div id="outline-container-org7bc85d5" class="outline-2">
<h2 id="org7bc85d5"><a href="https://time.geekbang.org/column/article/68785">复习课（五） | 管理沟通</a></h2>
<div class="outline-text-2" id="text-org7bc85d5">
<p>
本文以图文的形式带你复习一下“管理沟通”。
</p>
</div>
</div>
</div>
</body>
</html>
